#include "../include/menu.h"


// 菜单1：账号管理菜单(开始菜单)
void start_menu() {
    printf("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════╗\n");
    printf("\t\t\t╠═══════════════════════════════════════════════════════════════════════════════╣\n");
    printf("\t\t\t║\t\t\t\t1 - 登陆\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t2 - 注册\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t3 - 找回密码\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t4 - 修改密码\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t5 - 退出\t\t\t\t\t║\n");
    printf("\t\t\t╚═══════════════════════════════════════════════════════════════════════════════╝\n");
    printf("\n\t\t\t 请选择(1-6):");
}

// 菜单2：二级菜单(选择 是进入好友管理 还是群管理 还是文件管理)
void secondary_menu() {
    printf("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════╗\n");
    printf("\t\t\t╠═══════════════════════════════════════════════════════════════════════════════╣\n");
    printf("\t\t\t║\t\t\t\t1 - 好友管理\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t2 - 群管理  \t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t3 - 文件管理\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t4 - 退出\t\t\t\t\t║\n");
    printf("\t\t\t╚═══════════════════════════════════════════════════════════════════════════════╝\n");
    printf("\n\t\t\t 请选择(1-4):");
}

// 菜单3：好友管理菜单
void friends_management_menu() {
    printf("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════╗\n");
    printf("\t\t\t║\t\t\t\t好友管理菜单\t\t\t\t\t║\n");
    printf("\t\t\t╠═══════════════════════════════════════════════════════════════════════════════╣\n");
    printf("\t\t\t║\t\t\t\t4 - 添加好友\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t5 - 删除好友\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t6 - 查看好友列表\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t7 - 查看聊天记录\t\t\t\t║\n");   //
    printf("\t\t\t║\t\t\t\t8 - 拉黑好友\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t9 - 解除拉黑好友\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t10 - 与好友私聊\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t11 - 查看消息\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t12 - 返回上一级 \t\t\t\t\t║\n");
    printf("\t\t\t╚═══════════════════════════════════════════════════════════════════════════════╝\n");
    printf("\n\t\t\t 请选择(4-12):");
}


// 菜单4：群管理菜单
void group_management_menu() {
    printf("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════╗\n");
    printf("\t\t\t║\t\t\t\t群管理菜单\t\t\t\t\t║\n");
    printf("\t\t\t╠═══════════════════════════════════════════════════════════════════════════════╣\n");
    printf("\t\t\t║\t\t\t\t1 - 创建群\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t2 - 退群\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t3 - 申请加群\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t5 - 查看群列表\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t6 - 查看群成员\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t7 - 群聊\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t8 - 查看聊天记录\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t9 - 设置群管理员\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t10- 踢人\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t11- 查看群聊消息\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t0 - 返回上一级 \t\t\t\t\t║\n");
    printf("\t\t\t╚═══════════════════════════════════════════════════════════════════════════════╝\n");
    printf("\n\t\t\t 请选择(0-10):");
}

// 菜单5：文件管理菜单
void file_management_menu() {
    printf("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════╗\n");
    printf("\t\t\t║\t\t\t\t文件管理菜单\t\t\t\t\t║\n");
    printf("\t\t\t╠═══════════════════════════════════════════════════════════════════════════════╣\n");
    printf("\t\t\t║\t\t\t\t1 - 发送文件\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t2 - 接受文件\t\t\t\t\t║\n");
    printf("\t\t\t║\t\t\t\t0 - 返回上一级 \t\t\t\t\t║\n");
    printf("\t\t\t╚═══════════════════════════════════════════════════════════════════════════════╝\n");
    printf("\n\t\t\t 请选择(0-2):");
}
